Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.141/PIC32CK-SG00/include/component/dma.h
/*
 * Component description for DMA
 *
 * Copyright (c) 2023 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2023-04-05T13:26:46Z */
#ifndef _PIC32CKSG00_DMA_COMPONENT_H_
#define _PIC32CKSG00_DMA_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR DMA                                          */
/* ************************************************************************** */

/* -------- DMA_BDNXT : (DMA Offset: 0x00) (R/W 32) NEXT BUFFER DESCRIPTOR ADDRESS POINTER -------- */
#define DMA_BDNXT_RESETVALUE                  _UINT32_(0x00)                                       /*  (DMA_BDNXT) NEXT BUFFER DESCRIPTOR ADDRESS POINTER  Reset Value */

#define DMA_BDNXT_NXT_Pos                     _UINT32_(0)                                          /* (DMA_BDNXT) Next Descriptor Pointer Position */
#define DMA_BDNXT_NXT_Msk                     (_UINT32_(0xFFFFFFFF) << DMA_BDNXT_NXT_Pos)          /* (DMA_BDNXT) Next Descriptor Pointer Mask */
#define DMA_BDNXT_NXT(value)                  (DMA_BDNXT_NXT_Msk & (_UINT32_(value) << DMA_BDNXT_NXT_Pos)) /* Assigment of value for NXT in the DMA_BDNXT register */
#define DMA_BDNXT_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (DMA_BDNXT) Register Mask  */


/* -------- DMA_BDCFG : (DMA Offset: 0x04) (R/W 32) CURRENT BUFFER DESCRIPTOR CONFIGURATION -------- */
#define DMA_BDCFG_RESETVALUE                  _UINT32_(0x00)                                       /*  (DMA_BDCFG) CURRENT BUFFER DESCRIPTOR CONFIGURATION  Reset Value */

#define DMA_BDCFG_CTRLB_Pos                   _UINT32_(0)                                          /* (DMA_BDCFG) CTRLB Register Descriptor Load Position */
#define DMA_BDCFG_CTRLB_Msk                   (_UINT32_(0x1) << DMA_BDCFG_CTRLB_Pos)               /* (DMA_BDCFG) CTRLB Register Descriptor Load Mask */
#define DMA_BDCFG_CTRLB(value)                (DMA_BDCFG_CTRLB_Msk & (_UINT32_(value) << DMA_BDCFG_CTRLB_Pos)) /* Assigment of value for CTRLB in the DMA_BDCFG register */
#define DMA_BDCFG_EVCTRL_Pos                  _UINT32_(1)                                          /* (DMA_BDCFG) EVCTRL Register Descriptor Load Position */
#define DMA_BDCFG_EVCTRL_Msk                  (_UINT32_(0x1) << DMA_BDCFG_EVCTRL_Pos)              /* (DMA_BDCFG) EVCTRL Register Descriptor Load Mask */
#define DMA_BDCFG_EVCTRL(value)               (DMA_BDCFG_EVCTRL_Msk & (_UINT32_(value) << DMA_BDCFG_EVCTRL_Pos)) /* Assigment of value for EVCTRL in the DMA_BDCFG register */
#define DMA_BDCFG_SSA_Pos                     _UINT32_(2)                                          /* (DMA_BDCFG) SSA Register Descriptor Load Position */
#define DMA_BDCFG_SSA_Msk                     (_UINT32_(0x1) << DMA_BDCFG_SSA_Pos)                 /* (DMA_BDCFG) SSA Register Descriptor Load Mask */
#define DMA_BDCFG_SSA(value)                  (DMA_BDCFG_SSA_Msk & (_UINT32_(value) << DMA_BDCFG_SSA_Pos)) /* Assigment of value for SSA in the DMA_BDCFG register */
#define DMA_BDCFG_DSA_Pos                     _UINT32_(3)                                          /* (DMA_BDCFG) DSA Register Descriptor Load Position */
#define DMA_BDCFG_DSA_Msk                     (_UINT32_(0x1) << DMA_BDCFG_DSA_Pos)                 /* (DMA_BDCFG) DSA Register Descriptor Load Mask */
#define DMA_BDCFG_DSA(value)                  (DMA_BDCFG_DSA_Msk & (_UINT32_(value) << DMA_BDCFG_DSA_Pos)) /* Assigment of value for DSA in the DMA_BDCFG register */
#define DMA_BDCFG_SSTRD_Pos                   _UINT32_(4)                                          /* (DMA_BDCFG) SSTRD Register Descriptor Load Position */
#define DMA_BDCFG_SSTRD_Msk                   (_UINT32_(0x1) << DMA_BDCFG_SSTRD_Pos)               /* (DMA_BDCFG) SSTRD Register Descriptor Load Mask */
#define DMA_BDCFG_SSTRD(value)                (DMA_BDCFG_SSTRD_Msk & (_UINT32_(value) << DMA_BDCFG_SSTRD_Pos)) /* Assigment of value for SSTRD in the DMA_BDCFG register */
#define DMA_BDCFG_DSTRD_Pos                   _UINT32_(5)                                          /* (DMA_BDCFG) DSTRD Register Descriptor Load Position */
#define DMA_BDCFG_DSTRD_Msk                   (_UINT32_(0x1) << DMA_BDCFG_DSTRD_Pos)               /* (DMA_BDCFG) DSTRD Register Descriptor Load Mask */
#define DMA_BDCFG_DSTRD(value)                (DMA_BDCFG_DSTRD_Msk & (_UINT32_(value) << DMA_BDCFG_DSTRD_Pos)) /* Assigment of value for DSTRD in the DMA_BDCFG register */
#define DMA_BDCFG_XSIZ_Pos                    _UINT32_(6)                                          /* (DMA_BDCFG) XSIZ Register Descriptor Load Position */
#define DMA_BDCFG_XSIZ_Msk                    (_UINT32_(0x1) << DMA_BDCFG_XSIZ_Pos)                /* (DMA_BDCFG) XSIZ Register Descriptor Load Mask */
#define DMA_BDCFG_XSIZ(value)                 (DMA_BDCFG_XSIZ_Msk & (_UINT32_(value) << DMA_BDCFG_XSIZ_Pos)) /* Assigment of value for XSIZ in the DMA_BDCFG register */
#define DMA_BDCFG_PDAT_Pos                    _UINT32_(7)                                          /* (DMA_BDCFG) PDAT Register Descriptor Load Position */
#define DMA_BDCFG_PDAT_Msk                    (_UINT32_(0x1) << DMA_BDCFG_PDAT_Pos)                /* (DMA_BDCFG) PDAT Register Descriptor Load Mask */
#define DMA_BDCFG_PDAT(value)                 (DMA_BDCFG_PDAT_Msk & (_UINT32_(value) << DMA_BDCFG_PDAT_Pos)) /* Assigment of value for PDAT in the DMA_BDCFG register */
#define DMA_BDCFG_CTRLCRC_Pos                 _UINT32_(8)                                          /* (DMA_BDCFG) CTRLCRC Register Descriptor Load Position */
#define DMA_BDCFG_CTRLCRC_Msk                 (_UINT32_(0x1) << DMA_BDCFG_CTRLCRC_Pos)             /* (DMA_BDCFG) CTRLCRC Register Descriptor Load Mask */
#define DMA_BDCFG_CTRLCRC(value)              (DMA_BDCFG_CTRLCRC_Msk & (_UINT32_(value) << DMA_BDCFG_CTRLCRC_Pos)) /* Assigment of value for CTRLCRC in the DMA_BDCFG register */
#define DMA_BDCFG_CRCDAT_Pos                  _UINT32_(9)                                          /* (DMA_BDCFG) CRCDAT Register Descriptor Load Position */
#define DMA_BDCFG_CRCDAT_Msk                  (_UINT32_(0x1) << DMA_BDCFG_CRCDAT_Pos)              /* (DMA_BDCFG) CRCDAT Register Descriptor Load Mask */
#define DMA_BDCFG_CRCDAT(value)               (DMA_BDCFG_CRCDAT_Msk & (_UINT32_(value) << DMA_BDCFG_CRCDAT_Pos)) /* Assigment of value for CRCDAT in the DMA_BDCFG register */
#define DMA_BDCFG_ENABLE_Pos                  _UINT32_(24)                                         /* (DMA_BDCFG) Channel Enable Position */
#define DMA_BDCFG_ENABLE_Msk                  (_UINT32_(0x1) << DMA_BDCFG_ENABLE_Pos)              /* (DMA_BDCFG) Channel Enable Mask */
#define DMA_BDCFG_ENABLE(value)               (DMA_BDCFG_ENABLE_Msk & (_UINT32_(value) << DMA_BDCFG_ENABLE_Pos)) /* Assigment of value for ENABLE in the DMA_BDCFG register */
#define DMA_BDCFG_LLEN_Pos                    _UINT32_(25)                                         /* (DMA_BDCFG) Linked List Enable Position */
#define DMA_BDCFG_LLEN_Msk                    (_UINT32_(0x1) << DMA_BDCFG_LLEN_Pos)                /* (DMA_BDCFG) Linked List Enable Mask */
#define DMA_BDCFG_LLEN(value)                 (DMA_BDCFG_LLEN_Msk & (_UINT32_(value) << DMA_BDCFG_LLEN_Pos)) /* Assigment of value for LLEN in the DMA_BDCFG register */
#define DMA_BDCFG_SWFRC_Pos                   _UINT32_(26)                                         /* (DMA_BDCFG) Software Forced Trigger Position */
#define DMA_BDCFG_SWFRC_Msk                   (_UINT32_(0x1) << DMA_BDCFG_SWFRC_Pos)               /* (DMA_BDCFG) Software Forced Trigger Mask */
#define DMA_BDCFG_SWFRC(value)                (DMA_BDCFG_SWFRC_Msk & (_UINT32_(value) << DMA_BDCFG_SWFRC_Pos)) /* Assigment of value for SWFRC in the DMA_BDCFG register */
#define DMA_BDCFG_RUNSTDBY_Pos                _UINT32_(27)                                         /* (DMA_BDCFG) Run In Standby Position */
#define DMA_BDCFG_RUNSTDBY_Msk                (_UINT32_(0x1) << DMA_BDCFG_RUNSTDBY_Pos)            /* (DMA_BDCFG) Run In Standby Mask */
#define DMA_BDCFG_RUNSTDBY(value)             (DMA_BDCFG_RUNSTDBY_Msk & (_UINT32_(value) << DMA_BDCFG_RUNSTDBY_Pos)) /* Assigment of value for RUNSTDBY in the DMA_BDCFG register */
#define DMA_BDCFG_Msk                         _UINT32_(0x0F0003FF)                                 /* (DMA_BDCFG) Register Mask  */


/* -------- DMA_BDCTRLB : (DMA Offset: 0x08) (R/W 32) CURRENT BUFFER DESCRIPTOR CONTROL REGISTER B -------- */
#define DMA_BDCTRLB_RESETVALUE                _UINT32_(0x00)                                       /*  (DMA_BDCTRLB) CURRENT BUFFER DESCRIPTOR CONTROL REGISTER B  Reset Value */

#define DMA_BDCTRLB_WAS_Pos                   _UINT32_(0)                                          /* (DMA_BDCTRLB) Channel Write Address Sequence. Position */
#define DMA_BDCTRLB_WAS_Msk                   (_UINT32_(0x7) << DMA_BDCTRLB_WAS_Pos)               /* (DMA_BDCTRLB) Channel Write Address Sequence. Mask */
#define DMA_BDCTRLB_WAS(value)                (DMA_BDCTRLB_WAS_Msk & (_UINT32_(value) << DMA_BDCTRLB_WAS_Pos)) /* Assigment of value for WAS in the DMA_BDCTRLB register */
#define   DMA_BDCTRLB_WAS_BYTE_ADDR_INCR_Val  _UINT32_(0x0)                                        /* (DMA_BDCTRLB) Incrementing Address+1 with Transfers of Byte Operands  */
#define   DMA_BDCTRLB_WAS_HALF_WORD_ADDR_INCR_Val _UINT32_(0x1)                                        /* (DMA_BDCTRLB) Incrementing Address+2 with Transfers of HalfWord Operands  */
#define   DMA_BDCTRLB_WAS_AUTO_ADDR_INCR_Val  _UINT32_(0x2)                                        /* (DMA_BDCTRLB) Auto Increment Address and Transfer Size  */
#define   DMA_BDCTRLB_WAS_FIXED_BYTE_ADDR_INCR_Val _UINT32_(0x3)                                        /* (DMA_BDCTRLB) Fixed Byte Address (Single Byte Address with Enable Based upon 2 LSBs)  */
#define   DMA_BDCTRLB_WAS_FIXED_HALF_WORD_ADDR_INCR_Val _UINT32_(0x4)                                        /* (DMA_BDCTRLB) Fixed Address of HalfWord Operand (Single HalfWord Aligned Address)  */
#define   DMA_BDCTRLB_WAS_FIXED_WORD_ADDR_INCR_Val _UINT32_(0x5)                                        /* (DMA_BDCTRLB) Fixed Address Word Burst Transfer  */
#define DMA_BDCTRLB_WAS_BYTE_ADDR_INCR        (DMA_BDCTRLB_WAS_BYTE_ADDR_INCR_Val << DMA_BDCTRLB_WAS_Pos) /* (DMA_BDCTRLB) Incrementing Address+1 with Transfers of Byte Operands Position  */
#define DMA_BDCTRLB_WAS_HALF_WORD_ADDR_INCR   (DMA_BDCTRLB_WAS_HALF_WORD_ADDR_INCR_Val << DMA_BDCTRLB_WAS_Pos) /* (DMA_BDCTRLB) Incrementing Address+2 with Transfers of HalfWord Operands Position  */
#define DMA_BDCTRLB_WAS_AUTO_ADDR_INCR        (DMA_BDCTRLB_WAS_AUTO_ADDR_INCR_Val << DMA_BDCTRLB_WAS_Pos) /* (DMA_BDCTRLB) Auto Increment Address and Transfer Size Position  */
#define DMA_BDCTRLB_WAS_FIXED_BYTE_ADDR_INCR  (DMA_BDCTRLB_WAS_FIXED_BYTE_ADDR_INCR_Val << DMA_BDCTRLB_WAS_Pos) /* (DMA_BDCTRLB) Fixed Byte Address (Single Byte Address with Enable Based upon 2 LSBs) Position  */
#define DMA_BDCTRLB_WAS_FIXED_HALF_WORD_ADDR_INCR (DMA_BDCTRLB_WAS_FIXED_HALF_WORD_ADDR_INCR_Val << DMA_BDCTRLB_WAS_Pos) /* (DMA_BDCTRLB) Fixed Address of HalfWord Operand (Single HalfWord Aligned Address) Position  */
#define DMA_BDCTRLB_WAS_FIXED_WORD_ADDR_INCR  (DMA_BDCTRLB_WAS_FIXED_WORD_ADDR_INCR_Val << DMA_BDCTRLB_WAS_Pos) /* (DMA_BDCTRLB) Fixed Address Word Burst Transfer Position  */
#define DMA_BDCTRLB_RAS_Pos                   _UINT32_(4)                                          /* (DMA_BDCTRLB) Channel Read Address Sequence Position */
#define DMA_BDCTRLB_RAS_Msk                   (_UINT32_(0x7) << DMA_BDCTRLB_RAS_Pos)               /* (DMA_BDCTRLB) Channel Read Address Sequence Mask */
#define DMA_BDCTRLB_RAS(value)                (DMA_BDCTRLB_RAS_Msk & (_UINT32_(value) << DMA_BDCTRLB_RAS_Pos)) /* Assigment of value for RAS in the DMA_BDCTRLB register */
#define   DMA_BDCTRLB_RAS_BYTE_ADDR_INCR_Val  _UINT32_(0x0)                                        /* (DMA_BDCTRLB) Incrementing Address+1 with Transfers of Byte Operands  */
#define   DMA_BDCTRLB_RAS_HALF_WORD_ADDR_INCR_Val _UINT32_(0x1)                                        /* (DMA_BDCTRLB) Incrementing Address+2 with Transfers of HalfWord Operands  */
#define   DMA_BDCTRLB_RAS_AUTO_ADDR_INCR_Val  _UINT32_(0x2)                                        /* (DMA_BDCTRLB) Auto Increment Address and Transfer Size  */
#define   DMA_BDCTRLB_RAS_FIXED_BYTE_ADDR_INCR_Val _UINT32_(0x3)                                        /* (DMA_BDCTRLB) Fixed Byte Address (Single Byte Address with Enable Based upon 2 LSBs)  */
#define   DMA_BDCTRLB_RAS_FIXED_HALF_WORD_ADDR_INCR_Val _UINT32_(0x4)                                        /* (DMA_BDCTRLB) Fixed Address of HalfWord Operand (Single HalfWord Aligned Address)  */
#define   DMA_BDCTRLB_RAS_FIXED_WORD_ADDR_INCR_Val _UINT32_(0x5)                                        /* (DMA_BDCTRLB) Fixed Address Word Burst Transfer  */
#define DMA_BDCTRLB_RAS_BYTE_ADDR_INCR        (DMA_BDCTRLB_RAS_BYTE_ADDR_INCR_Val << DMA_BDCTRLB_RAS_Pos) /* (DMA_BDCTRLB) Incrementing Address+1 with Transfers of Byte Operands Position  */
#define DMA_BDCTRLB_RAS_HALF_WORD_ADDR_INCR   (DMA_BDCTRLB_RAS_HALF_WORD_ADDR_INCR_Val << DMA_BDCTRLB_RAS_Pos) /* (DMA_BDCTRLB) Incrementing Address+2 with Transfers of HalfWord Operands Position  */
#define DMA_BDCTRLB_RAS_AUTO_ADDR_INCR        (DMA_BDCTRLB_RAS_AUTO_ADDR_INCR_Val << DMA_BDCTRLB_RAS_Pos) /* (DMA_BDCTRLB) Auto Increment Address and Transfer Size Position  */
#define DMA_BDCTRLB_RAS_FIXED_BYTE_ADDR_INCR  (DMA_BDCTRLB_RAS_FIXED_BYTE_ADDR_INCR_Val << DMA_BDCTRLB_RAS_Pos) /* (DMA_BDCTRLB) Fixed Byte Address (Single Byte Address with Enable Based upon 2 LSBs) Position  */
#define DMA_BDCTRLB_RAS_FIXED_HALF_WORD_ADDR_INCR (DMA_BDCTRLB_RAS_FIXED_HALF_WORD_ADDR_INCR_Val << DMA_BDCTRLB_RAS_Pos) /* (DMA_BDCTRLB) Fixed Address of HalfWord Operand (Single HalfWord Aligned Address) Position  */
#define DMA_BDCTRLB_RAS_FIXED_WORD_ADDR_INCR  (DMA_BDCTRLB_RAS_FIXED_WORD_ADDR_INCR_Val << DMA_BDCTRLB_RAS_Pos) /* (DMA_BDCTRLB) Fixed Address Word Burst Transfer Position  */
#define DMA_BDCTRLB_PRI_Pos                   _UINT32_(8)                                          /* (DMA_BDCTRLB) Channel Priority level. Position */
#define DMA_BDCTRLB_PRI_Msk                   (_UINT32_(0x3) << DMA_BDCTRLB_PRI_Pos)               /* (DMA_BDCTRLB) Channel Priority level. Mask */
#define DMA_BDCTRLB_PRI(value)                (DMA_BDCTRLB_PRI_Msk & (_UINT32_(value) << DMA_BDCTRLB_PRI_Pos)) /* Assigment of value for PRI in the DMA_BDCTRLB register */
#define   DMA_BDCTRLB_PRI_PRI_1_Val           _UINT32_(0x0)                                        /* (DMA_BDCTRLB) Channel Priority is 1  */
#define   DMA_BDCTRLB_PRI_PRI_2_Val           _UINT32_(0x1)                                        /* (DMA_BDCTRLB) Channel Priority is 2  */
#define   DMA_BDCTRLB_PRI_PRI_3_Val           _UINT32_(0x2)                                        /* (DMA_BDCTRLB) Channel Priority is 3 (HIGHEST)  */
#define DMA_BDCTRLB_PRI_PRI_1                 (DMA_BDCTRLB_PRI_PRI_1_Val << DMA_BDCTRLB_PRI_Pos)   /* (DMA_BDCTRLB) Channel Priority is 1 Position  */
#define DMA_BDCTRLB_PRI_PRI_2                 (DMA_BDCTRLB_PRI_PRI_2_Val << DMA_BDCTRLB_PRI_Pos)   /* (DMA_BDCTRLB) Channel Priority is 2 Position  */
#define DMA_BDCTRLB_PRI_PRI_3                 (DMA_BDCTRLB_PRI_PRI_3_Val << DMA_BDCTRLB_PRI_Pos)   /* (DMA_BDCTRLB) Channel Priority is 3 (HIGHEST) Position  */
#define DMA_BDCTRLB_WBOEN_Pos                 _UINT32_(13)                                         /* (DMA_BDCTRLB) Write Byte Order Enable Position */
#define DMA_BDCTRLB_WBOEN_Msk                 (_UINT32_(0x1) << DMA_BDCTRLB_WBOEN_Pos)             /* (DMA_BDCTRLB) Write Byte Order Enable Mask */
#define DMA_BDCTRLB_WBOEN(value)              (DMA_BDCTRLB_WBOEN_Msk & (_UINT32_(value) << DMA_BDCTRLB_WBOEN_Pos)) /* Assigment of value for WBOEN in the DMA_BDCTRLB register */
#define DMA_BDCTRLB_BYTORD_Pos                _UINT32_(14)                                         /* (DMA_BDCTRLB) Byte Order Position */
#define DMA_BDCTRLB_BYTORD_Msk                (_UINT32_(0x3) << DMA_BDCTRLB_BYTORD_Pos)            /* (DMA_BDCTRLB) Byte Order Mask */
#define DMA_BDCTRLB_BYTORD(value)             (DMA_BDCTRLB_BYTORD_Msk & (_UINT32_(value) << DMA_BDCTRLB_BYTORD_Pos)) /* Assigment of value for BYTORD in the DMA_BDCTRLB register */
#define   DMA_BDCTRLB_BYTORD_BYTORD_NONE_Val  _UINT32_(0x0)                                        /* (DMA_BDCTRLB) Bytes are processed AS IS  */
#define   DMA_BDCTRLB_BYTORD_BYTORD_WORD_SWIZZLE_Val _UINT32_(0x1)                                        /* (DMA_BDCTRLB) Bytes are swapped as: BYTE3 to BYTE0, BYTE2 to BYTE1, BYTE1 to BYTE2, and BYTE0 to BYTE3  */
#define   DMA_BDCTRLB_BYTORD_BYTORD_HALF_WORD_SWIZZLE_Val _UINT32_(0x2)                                        /* (DMA_BDCTRLB) Bytes are swapped as: BYTE3 to BYTE1, BYTE2 to BYTE0, BYTE1 to BYTE3, and BYTE0 to BYTE2  */
#define   DMA_BDCTRLB_BYTORD_BYTORD_BYTE_SWIZZLE_Val _UINT32_(0x3)                                        /* (DMA_BDCTRLB) Bytes are swapped as: BYTE3 to BYTE2, BYTE2 to BYTE3, BYTE1 to BYTE1, and BYTE0 to BYTE1  */
#define DMA_BDCTRLB_BYTORD_BYTORD_NONE        (DMA_BDCTRLB_BYTORD_BYTORD_NONE_Val << DMA_BDCTRLB_BYTORD_Pos) /* (DMA_BDCTRLB) Bytes are processed AS IS Position  */
#define DMA_BDCTRLB_BYTORD_BYTORD_WORD_SWIZZLE (DMA_BDCTRLB_BYTORD_BYTORD_WORD_SWIZZLE_Val << DMA_BDCTRLB_BYTORD_Pos) /* (DMA_BDCTRLB) Bytes are swapped as: BYTE3 to BYTE0, BYTE2 to BYTE1, BYTE1 to BYTE2, and BYTE0 to BYTE3 Position  */
#define DMA_BDCTRLB_BYTORD_BYTORD_HALF_WORD_SWIZZLE (DMA_BDCTRLB_BYTORD_BYTORD_HALF_WORD_SWIZZLE_Val << DMA_BDCTRLB_BYTORD_Pos) /* (DMA_BDCTRLB) Bytes are swapped as: BYTE3 to BYTE1, BYTE2 to BYTE0, BYTE1 to BYTE3, and BYTE0 to BYTE2 Position  */
#define DMA_BDCTRLB_BYTORD_BYTORD_BYTE_SWIZZLE (DMA_BDCTRLB_BYTORD_BYTORD_BYTE_SWIZZLE_Val << DMA_BDCTRLB_BYTORD_Pos) /* (DMA_BDCTRLB) Bytes are swapped as: BYTE3 to BYTE2, BYTE2 to BYTE3, BYTE1 to BYTE1, and BYTE0 to BYTE1 Position  */
#define DMA_BDCTRLB_TRIG_Pos                  _UINT32_(16)                                         /* (DMA_BDCTRLB) Trigger that can Start a Channel Transfer Position */
#define DMA_BDCTRLB_TRIG_Msk                  (_UINT32_(0xFF) << DMA_BDCTRLB_TRIG_Pos)             /* (DMA_BDCTRLB) Trigger that can Start a Channel Transfer Mask */
#define DMA_BDCTRLB_TRIG(value)               (DMA_BDCTRLB_TRIG_Msk & (_UINT32_(value) << DMA_BDCTRLB_TRIG_Pos)) /* Assigment of value for TRIG in the DMA_BDCTRLB register */
#define DMA_BDCTRLB_PIGNEN_Pos                _UINT32_(24)                                         /* (DMA_BDCTRLB) Enable Pattern Ignore Byte Position */
#define DMA_BDCTRLB_PIGNEN_Msk                (_UINT32_(0x1) << DMA_BDCTRLB_PIGNEN_Pos)            /* (DMA_BDCTRLB) Enable Pattern Ignore Byte Mask */
#define DMA_BDCTRLB_PIGNEN(value)             (DMA_BDCTRLB_PIGNEN_Msk & (_UINT32_(value) << DMA_BDCTRLB_PIGNEN_Pos)) /* Assigment of value for PIGNEN in the DMA_BDCTRLB register */
#define DMA_BDCTRLB_PATLEN_Pos                _UINT32_(25)                                         /* (DMA_BDCTRLB) Pattern Match Length Position */
#define DMA_BDCTRLB_PATLEN_Msk                (_UINT32_(0x1) << DMA_BDCTRLB_PATLEN_Pos)            /* (DMA_BDCTRLB) Pattern Match Length Mask */
#define DMA_BDCTRLB_PATLEN(value)             (DMA_BDCTRLB_PATLEN_Msk & (_UINT32_(value) << DMA_BDCTRLB_PATLEN_Pos)) /* Assigment of value for PATLEN in the DMA_BDCTRLB register */
#define DMA_BDCTRLB_PATEN_Pos                 _UINT32_(26)                                         /* (DMA_BDCTRLB) Channel Pattern Match Abort Enable. Position */
#define DMA_BDCTRLB_PATEN_Msk                 (_UINT32_(0x1) << DMA_BDCTRLB_PATEN_Pos)             /* (DMA_BDCTRLB) Channel Pattern Match Abort Enable. Mask */
#define DMA_BDCTRLB_PATEN(value)              (DMA_BDCTRLB_PATEN_Msk & (_UINT32_(value) << DMA_BDCTRLB_PATEN_Pos)) /* Assigment of value for PATEN in the DMA_BDCTRLB register */
#define DMA_BDCTRLB_CASTEN_Pos                _UINT32_(29)                                         /* (DMA_BDCTRLB) Cell Auto Start Enable of Ensuing Transfers for this channel Position */
#define DMA_BDCTRLB_CASTEN_Msk                (_UINT32_(0x1) << DMA_BDCTRLB_CASTEN_Pos)            /* (DMA_BDCTRLB) Cell Auto Start Enable of Ensuing Transfers for this channel Mask */
#define DMA_BDCTRLB_CASTEN(value)             (DMA_BDCTRLB_CASTEN_Msk & (_UINT32_(value) << DMA_BDCTRLB_CASTEN_Pos)) /* Assigment of value for CASTEN in the DMA_BDCTRLB register */
#define DMA_BDCTRLB_CRCEN_Pos                 _UINT32_(31)                                         /* (DMA_BDCTRLB) CRC Enable bit Position */
#define DMA_BDCTRLB_CRCEN_Msk                 (_UINT32_(0x1) << DMA_BDCTRLB_CRCEN_Pos)             /* (DMA_BDCTRLB) CRC Enable bit Mask */
#define DMA_BDCTRLB_CRCEN(value)              (DMA_BDCTRLB_CRCEN_Msk & (_UINT32_(value) << DMA_BDCTRLB_CRCEN_Pos)) /* Assigment of value for CRCEN in the DMA_BDCTRLB register */
#define DMA_BDCTRLB_Msk                       _UINT32_(0xA7FFE377)                                 /* (DMA_BDCTRLB) Register Mask  */


