Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.141/PIC32CK-SG00/include/component/dma.h
#define DMA_INTSTAT2_CH_Pos                   _UINT32_(0)                                          /* (DMA_INTSTAT2 Position) DMA Channel active interrupt at priority 2 */
#define DMA_INTSTAT2_CH_Msk                   (_UINT32_(0xFFFFFF) << DMA_INTSTAT2_CH_Pos)          /* (DMA_INTSTAT2 Mask) CH */
#define DMA_INTSTAT2_CH(value)                (DMA_INTSTAT2_CH_Msk & (_UINT32_(value) << DMA_INTSTAT2_CH_Pos)) 

/* -------- DMA_INTSTAT1 : (DMA Offset: 0x20) ( R/ 32) DMA INTERRUPT PRIORITY 1 STATUS REGISTER -------- */
#define DMA_INTSTAT1_RESETVALUE               _UINT32_(0x00)                                       /*  (DMA_INTSTAT1) DMA INTERRUPT PRIORITY 1 STATUS REGISTER  Reset Value */

#define DMA_INTSTAT1_CH0_Pos                  _UINT32_(0)                                          /* (DMA_INTSTAT1) DMA Channel active interrupt at priority 1 Position */
#define DMA_INTSTAT1_CH0_Msk                  (_UINT32_(0x1) << DMA_INTSTAT1_CH0_Pos)              /* (DMA_INTSTAT1) DMA Channel active interrupt at priority 1 Mask */
#define DMA_INTSTAT1_CH0(value)               (DMA_INTSTAT1_CH0_Msk & (_UINT32_(value) << DMA_INTSTAT1_CH0_Pos)) /* Assigment of value for CH0 in the DMA_INTSTAT1 register */
#define DMA_INTSTAT1_CH1_Pos                  _UINT32_(1)                                          /* (DMA_INTSTAT1) DMA Channel active interrupt at priority 1 Position */
#define DMA_INTSTAT1_CH1_Msk                  (_UINT32_(0x1) << DMA_INTSTAT1_CH1_Pos)              /* (DMA_INTSTAT1) DMA Channel active interrupt at priority 1 Mask */
#define DMA_INTSTAT1_CH1(value)               (DMA_INTSTAT1_CH1_Msk & (_UINT32_(value) << DMA_INTSTAT1_CH1_Pos)) /* Assigment of value for CH1 in the DMA_INTSTAT1 register */
#define DMA_INTSTAT1_CH2_Pos                  _UINT32_(2)                                          /* (DMA_INTSTAT1) DMA Channel active interrupt at priority 1 Position */
#define DMA_INTSTAT1_CH2_Msk                  (_UINT32_(0x1) << DMA_INTSTAT1_CH2_Pos)              /* (DMA_INTSTAT1) DMA Channel active interrupt at priority 1 Mask */
#define DMA_INTSTAT1_CH2(value)               (DMA_INTSTAT1_CH2_Msk & (_UINT32_(value) << DMA_INTSTAT1_CH2_Pos)) /* Assigment of value for CH2 in the DMA_INTSTAT1 register */
#define DMA_INTSTAT1_CH3_Pos                  _UINT32_(3)                                          /* (DMA_INTSTAT1) DMA Channel active interrupt at priority 1 Position */
#define DMA_INTSTAT1_CH3_Msk                  (_UINT32_(0x1) << DMA_INTSTAT1_CH3_Pos)              /* (DMA_INTSTAT1) DMA Channel active interrupt at priority 1 Mask */
#define DMA_INTSTAT1_CH3(value)               (DMA_INTSTAT1_CH3_Msk & (_UINT32_(value) << DMA_INTSTAT1_CH3_Pos)) /* Assigment of value for CH3 in the DMA_INTSTAT1 register */
#define DMA_INTSTAT1_CH4_Pos                  _UINT32_(4)                                          /* (DMA_INTSTAT1) DMA Channel active interrupt at priority 1 Position */
#define DMA_INTSTAT1_CH4_Msk                  (_UINT32_(0x1) << DMA_INTSTAT1_CH4_Pos)              /* (DMA_INTSTAT1) DMA Channel active interrupt at priority 1 Mask */
#define DMA_INTSTAT1_CH4(value)               (DMA_INTSTAT1_CH4_Msk & (_UINT32_(value) << DMA_INTSTAT1_CH4_Pos)) /* Assigment of value for CH4 in the DMA_INTSTAT1 register */
#define DMA_INTSTAT1_CH5_Pos                  _UINT32_(5)                                          /* (DMA_INTSTAT1) DMA Channel active interrupt at priority 1 Position */
#define DMA_INTSTAT1_CH5_Msk                  (_UINT32_(0x1) << DMA_INTSTAT1_CH5_Pos)              /* (DMA_INTSTAT1) DMA Channel active interrupt at priority 1 Mask */
#define DMA_INTSTAT1_CH5(value)               (DMA_INTSTAT1_CH5_Msk & (_UINT32_(value) << DMA_INTSTAT1_CH5_Pos)) /* Assigment of value for CH5 in the DMA_INTSTAT1 register */
#define DMA_INTSTAT1_CH6_Pos                  _UINT32_(6)                                          /* (DMA_INTSTAT1) DMA Channel active interrupt at priority 1 Position */
#define DMA_INTSTAT1_CH6_Msk                  (_UINT32_(0x1) << DMA_INTSTAT1_CH6_Pos)              /* (DMA_INTSTAT1) DMA Channel active interrupt at priority 1 Mask */
#define DMA_INTSTAT1_CH6(value)               (DMA_INTSTAT1_CH6_Msk & (_UINT32_(value) << DMA_INTSTAT1_CH6_Pos)) /* Assigment of value for CH6 in the DMA_INTSTAT1 register */
#define DMA_INTSTAT1_CH7_Pos                  _UINT32_(7)                                          /* (DMA_INTSTAT1) DMA Channel active interrupt at priority 1 Position */
#define DMA_INTSTAT1_CH7_Msk                  (_UINT32_(0x1) << DMA_INTSTAT1_CH7_Pos)              /* (DMA_INTSTAT1) DMA Channel active interrupt at priority 1 Mask */
#define DMA_INTSTAT1_CH7(value)               (DMA_INTSTAT1_CH7_Msk & (_UINT32_(value) << DMA_INTSTAT1_CH7_Pos)) /* Assigment of value for CH7 in the DMA_INTSTAT1 register */
#define DMA_INTSTAT1_CH8_Pos                  _UINT32_(8)                                          /* (DMA_INTSTAT1) DMA Channel active interrupt at priority 1 Position */
#define DMA_INTSTAT1_CH8_Msk                  (_UINT32_(0x1) << DMA_INTSTAT1_CH8_Pos)              /* (DMA_INTSTAT1) DMA Channel active interrupt at priority 1 Mask */
#define DMA_INTSTAT1_CH8(value)               (DMA_INTSTAT1_CH8_Msk & (_UINT32_(value) << DMA_INTSTAT1_CH8_Pos)) /* Assigment of value for CH8 in the DMA_INTSTAT1 register */
#define DMA_INTSTAT1_CH9_Pos                  _UINT32_(9)                                          /* (DMA_INTSTAT1) DMA Channel active interrupt at priority 1 Position */
#define DMA_INTSTAT1_CH9_Msk                  (_UINT32_(0x1) << DMA_INTSTAT1_CH9_Pos)              /* (DMA_INTSTAT1) DMA Channel active interrupt at priority 1 Mask */
#define DMA_INTSTAT1_CH9(value)               (DMA_INTSTAT1_CH9_Msk & (_UINT32_(value) << DMA_INTSTAT1_CH9_Pos)) /* Assigment of value for CH9 in the DMA_INTSTAT1 register */
#define DMA_INTSTAT1_CH10_Pos                 _UINT32_(10)                                         /* (DMA_INTSTAT1) DMA Channel active interrupt at priority 1 Position */
#define DMA_INTSTAT1_CH10_Msk                 (_UINT32_(0x1) << DMA_INTSTAT1_CH10_Pos)             /* (DMA_INTSTAT1) DMA Channel active interrupt at priority 1 Mask */
#define DMA_INTSTAT1_CH10(value)              (DMA_INTSTAT1_CH10_Msk & (_UINT32_(value) << DMA_INTSTAT1_CH10_Pos)) /* Assigment of value for CH10 in the DMA_INTSTAT1 register */
#define DMA_INTSTAT1_CH11_Pos                 _UINT32_(11)                                         /* (DMA_INTSTAT1) DMA Channel active interrupt at priority 1 Position */
#define DMA_INTSTAT1_CH11_Msk                 (_UINT32_(0x1) << DMA_INTSTAT1_CH11_Pos)             /* (DMA_INTSTAT1) DMA Channel active interrupt at priority 1 Mask */
#define DMA_INTSTAT1_CH11(value)              (DMA_INTSTAT1_CH11_Msk & (_UINT32_(value) << DMA_INTSTAT1_CH11_Pos)) /* Assigment of value for CH11 in the DMA_INTSTAT1 register */
#define DMA_INTSTAT1_CH12_Pos                 _UINT32_(12)                                         /* (DMA_INTSTAT1) DMA Channel active interrupt at priority 1 Position */
#define DMA_INTSTAT1_CH12_Msk                 (_UINT32_(0x1) << DMA_INTSTAT1_CH12_Pos)             /* (DMA_INTSTAT1) DMA Channel active interrupt at priority 1 Mask */
#define DMA_INTSTAT1_CH12(value)              (DMA_INTSTAT1_CH12_Msk & (_UINT32_(value) << DMA_INTSTAT1_CH12_Pos)) /* Assigment of value for CH12 in the DMA_INTSTAT1 register */
#define DMA_INTSTAT1_CH13_Pos                 _UINT32_(13)                                         /* (DMA_INTSTAT1) DMA Channel active interrupt at priority 1 Position */
#define DMA_INTSTAT1_CH13_Msk                 (_UINT32_(0x1) << DMA_INTSTAT1_CH13_Pos)             /* (DMA_INTSTAT1) DMA Channel active interrupt at priority 1 Mask */
#define DMA_INTSTAT1_CH13(value)              (DMA_INTSTAT1_CH13_Msk & (_UINT32_(value) << DMA_INTSTAT1_CH13_Pos)) /* Assigment of value for CH13 in the DMA_INTSTAT1 register */
#define DMA_INTSTAT1_CH14_Pos                 _UINT32_(14)                                         /* (DMA_INTSTAT1) DMA Channel active interrupt at priority 1 Position */
#define DMA_INTSTAT1_CH14_Msk                 (_UINT32_(0x1) << DMA_INTSTAT1_CH14_Pos)             /* (DMA_INTSTAT1) DMA Channel active interrupt at priority 1 Mask */
#define DMA_INTSTAT1_CH14(value)              (DMA_INTSTAT1_CH14_Msk & (_UINT32_(value) << DMA_INTSTAT1_CH14_Pos)) /* Assigment of value for CH14 in the DMA_INTSTAT1 register */
#define DMA_INTSTAT1_CH15_Pos                 _UINT32_(15)                                         /* (DMA_INTSTAT1) DMA Channel active interrupt at priority 1 Position */
#define DMA_INTSTAT1_CH15_Msk                 (_UINT32_(0x1) << DMA_INTSTAT1_CH15_Pos)             /* (DMA_INTSTAT1) DMA Channel active interrupt at priority 1 Mask */
#define DMA_INTSTAT1_CH15(value)              (DMA_INTSTAT1_CH15_Msk & (_UINT32_(value) << DMA_INTSTAT1_CH15_Pos)) /* Assigment of value for CH15 in the DMA_INTSTAT1 register */
#define DMA_INTSTAT1_CH16_Pos                 _UINT32_(16)                                         /* (DMA_INTSTAT1) DMA Channel active interrupt at priority 1 Position */
#define DMA_INTSTAT1_CH16_Msk                 (_UINT32_(0x1) << DMA_INTSTAT1_CH16_Pos)             /* (DMA_INTSTAT1) DMA Channel active interrupt at priority 1 Mask */
#define DMA_INTSTAT1_CH16(value)              (DMA_INTSTAT1_CH16_Msk & (_UINT32_(value) << DMA_INTSTAT1_CH16_Pos)) /* Assigment of value for CH16 in the DMA_INTSTAT1 register */
#define DMA_INTSTAT1_CH17_Pos                 _UINT32_(17)                                         /* (DMA_INTSTAT1) DMA Channel active interrupt at priority 1 Position */
#define DMA_INTSTAT1_CH17_Msk                 (_UINT32_(0x1) << DMA_INTSTAT1_CH17_Pos)             /* (DMA_INTSTAT1) DMA Channel active interrupt at priority 1 Mask */
#define DMA_INTSTAT1_CH17(value)              (DMA_INTSTAT1_CH17_Msk & (_UINT32_(value) << DMA_INTSTAT1_CH17_Pos)) /* Assigment of value for CH17 in the DMA_INTSTAT1 register */
#define DMA_INTSTAT1_CH18_Pos                 _UINT32_(18)                                         /* (DMA_INTSTAT1) DMA Channel active interrupt at priority 1 Position */
#define DMA_INTSTAT1_CH18_Msk                 (_UINT32_(0x1) << DMA_INTSTAT1_CH18_Pos)             /* (DMA_INTSTAT1) DMA Channel active interrupt at priority 1 Mask */
#define DMA_INTSTAT1_CH18(value)              (DMA_INTSTAT1_CH18_Msk & (_UINT32_(value) << DMA_INTSTAT1_CH18_Pos)) /* Assigment of value for CH18 in the DMA_INTSTAT1 register */
#define DMA_INTSTAT1_CH19_Pos                 _UINT32_(19)                                         /* (DMA_INTSTAT1) DMA Channel active interrupt at priority 1 Position */
#define DMA_INTSTAT1_CH19_Msk                 (_UINT32_(0x1) << DMA_INTSTAT1_CH19_Pos)             /* (DMA_INTSTAT1) DMA Channel active interrupt at priority 1 Mask */
#define DMA_INTSTAT1_CH19(value)              (DMA_INTSTAT1_CH19_Msk & (_UINT32_(value) << DMA_INTSTAT1_CH19_Pos)) /* Assigment of value for CH19 in the DMA_INTSTAT1 register */
#define DMA_INTSTAT1_CH20_Pos                 _UINT32_(20)                                         /* (DMA_INTSTAT1) DMA Channel active interrupt at priority 1 Position */
#define DMA_INTSTAT1_CH20_Msk                 (_UINT32_(0x1) << DMA_INTSTAT1_CH20_Pos)             /* (DMA_INTSTAT1) DMA Channel active interrupt at priority 1 Mask */
#define DMA_INTSTAT1_CH20(value)              (DMA_INTSTAT1_CH20_Msk & (_UINT32_(value) << DMA_INTSTAT1_CH20_Pos)) /* Assigment of value for CH20 in the DMA_INTSTAT1 register */
#define DMA_INTSTAT1_CH21_Pos                 _UINT32_(21)                                         /* (DMA_INTSTAT1) DMA Channel active interrupt at priority 1 Position */
#define DMA_INTSTAT1_CH21_Msk                 (_UINT32_(0x1) << DMA_INTSTAT1_CH21_Pos)             /* (DMA_INTSTAT1) DMA Channel active interrupt at priority 1 Mask */
#define DMA_INTSTAT1_CH21(value)              (DMA_INTSTAT1_CH21_Msk & (_UINT32_(value) << DMA_INTSTAT1_CH21_Pos)) /* Assigment of value for CH21 in the DMA_INTSTAT1 register */
#define DMA_INTSTAT1_CH22_Pos                 _UINT32_(22)                                         /* (DMA_INTSTAT1) DMA Channel active interrupt at priority 1 Position */
#define DMA_INTSTAT1_CH22_Msk                 (_UINT32_(0x1) << DMA_INTSTAT1_CH22_Pos)             /* (DMA_INTSTAT1) DMA Channel active interrupt at priority 1 Mask */
#define DMA_INTSTAT1_CH22(value)              (DMA_INTSTAT1_CH22_Msk & (_UINT32_(value) << DMA_INTSTAT1_CH22_Pos)) /* Assigment of value for CH22 in the DMA_INTSTAT1 register */
#define DMA_INTSTAT1_CH23_Pos                 _UINT32_(23)                                         /* (DMA_INTSTAT1) DMA Channel active interrupt at priority 1 Position */
#define DMA_INTSTAT1_CH23_Msk                 (_UINT32_(0x1) << DMA_INTSTAT1_CH23_Pos)             /* (DMA_INTSTAT1) DMA Channel active interrupt at priority 1 Mask */
#define DMA_INTSTAT1_CH23(value)              (DMA_INTSTAT1_CH23_Msk & (_UINT32_(value) << DMA_INTSTAT1_CH23_Pos)) /* Assigment of value for CH23 in the DMA_INTSTAT1 register */
#define DMA_INTSTAT1_Msk                      _UINT32_(0x00FFFFFF)                                 /* (DMA_INTSTAT1) Register Mask  */

#define DMA_INTSTAT1_CH_Pos                   _UINT32_(0)                                          /* (DMA_INTSTAT1 Position) DMA Channel active interrupt at priority x */
#define DMA_INTSTAT1_CH_Msk                   (_UINT32_(0xFFFFFF) << DMA_INTSTAT1_CH_Pos)          /* (DMA_INTSTAT1 Mask) CH */
#define DMA_INTSTAT1_CH(value)                (DMA_INTSTAT1_CH_Msk & (_UINT32_(value) << DMA_INTSTAT1_CH_Pos)) 

/** \brief DMA register offsets definitions */
#define DMA_BDNXT_REG_OFST             _UINT32_(0x00)      /* (DMA_BDNXT) NEXT BUFFER DESCRIPTOR ADDRESS POINTER Offset */
#define DMA_BDCFG_REG_OFST             _UINT32_(0x04)      /* (DMA_BDCFG) CURRENT BUFFER DESCRIPTOR CONFIGURATION Offset */
#define DMA_BDCTRLB_REG_OFST           _UINT32_(0x08)      /* (DMA_BDCTRLB) CURRENT BUFFER DESCRIPTOR CONTROL REGISTER B Offset */
#define DMA_BDEVCTRL_REG_OFST          _UINT32_(0x0C)      /* (DMA_BDEVCTRL) CURRENT BUFFER DESCRIPTOR EVENT CONTROL Offset */
#define DMA_BDCTRLCRC_REG_OFST         _UINT32_(0x0E)      /* (DMA_BDCTRLCRC) CURRENT BUFFER DESCRIPTOR CRC CONTROL Offset */
#define DMA_BDSSA_REG_OFST             _UINT32_(0x10)      /* (DMA_BDSSA) CURRENT BUFFER DESCRIPTOR SOURCE START ADDRESS Offset */
#define DMA_BDDSA_REG_OFST             _UINT32_(0x14)      /* (DMA_BDDSA) CURRENT BUFFER DESCRIPTOR DESTINATION START ADDRESS Offset */
#define DMA_BDSSTRD_REG_OFST           _UINT32_(0x18)      /* (DMA_BDSSTRD) CURRENT BUFFER DESCRIPTOR SOURCE CELL STRIDE Offset */
#define DMA_BDDSTRD_REG_OFST           _UINT32_(0x1A)      /* (DMA_BDDSTRD) CURRENT BUFFER DESCRIPTOR DESTINATION CELL STRIDE Offset */
#define DMA_BDXSIZ_REG_OFST            _UINT32_(0x1C)      /* (DMA_BDXSIZ) CURRENT BUFFER DESCRIPTOR TRANSFER SIZE Offset */
#define DMA_BDPDAT_REG_OFST            _UINT32_(0x20)      /* (DMA_BDPDAT) CURRENT BUFFER DESCRIPTOR PATTERN MATCH DATA Offset */
#define DMA_BDCRCDAT_REG_OFST          _UINT32_(0x24)      /* (DMA_BDCRCDAT) CURRENT BUFFER DESCRIPTOR CRC/CHECKSUM DATA Offset */
#define DMA_CHCTRLA_REG_OFST           _UINT32_(0x00)      /* (DMA_CHCTRLA) CHANNEL CONTROL REGISTER A Offset */
#define DMA_CHCTRLB_REG_OFST           _UINT32_(0x04)      /* (DMA_CHCTRLB) CHANNEL CONTROL REGISTER B Offset */
#define DMA_CHEVCTRL_REG_OFST          _UINT32_(0x08)      /* (DMA_CHEVCTRL) CHANNEL EVENT CONTROL REGISTER Offset */
#define DMA_CHINTENCLR_REG_OFST        _UINT32_(0x0C)      /* (DMA_CHINTENCLR) CHANNEL INTERRUPT ENABLE CLEAR REGISTER Offset */
#define DMA_CHINTENSET_REG_OFST        _UINT32_(0x10)      /* (DMA_CHINTENSET) CHANNEL INTERRUPT ENABLE SET REGISTER Offset */
#define DMA_CHINTF_REG_OFST            _UINT32_(0x14)      /* (DMA_CHINTF) CHANNEL INTERRUPT FLAG REGISTER Offset */
#define DMA_CHSSA_REG_OFST             _UINT32_(0x18)      /* (DMA_CHSSA) CHANNEL SOURCE START ADDRESS Offset */
#define DMA_CHDSA_REG_OFST             _UINT32_(0x1C)      /* (DMA_CHDSA) CHANNEL DESTINATION START ADDRESS Offset */
#define DMA_CHSSTRD_REG_OFST           _UINT32_(0x20)      /* (DMA_CHSSTRD) CHANNEL SOURCE CELL STRIDE SIZE REGISTER Offset */
#define DMA_CHDSTRD_REG_OFST           _UINT32_(0x24)      /* (DMA_CHDSTRD) CHANNEL DESTINATION CELL STRIDE SIZE REGISTER Offset */
#define DMA_CHXSIZ_REG_OFST            _UINT32_(0x28)      /* (DMA_CHXSIZ) CHANNEL TRANSFER SIZE REGISTER Offset */
#define DMA_CHPDAT_REG_OFST            _UINT32_(0x2C)      /* (DMA_CHPDAT) CHANNEL PATTERN MATCH DATA Offset */
#define DMA_CHCTRLCRC_REG_OFST         _UINT32_(0x30)      /* (DMA_CHCTRLCRC) CHANNEL CONTROL CRC Offset */
#define DMA_CHCRCDAT_REG_OFST          _UINT32_(0x34)      /* (DMA_CHCRCDAT) CHANNEL CRC/CHECKSUM DATA REGISTER Offset */
#define DMA_CHNXT_REG_OFST             _UINT32_(0x38)      /* (DMA_CHNXT) CHANNEL NEXT DESCRIPTOR ADDRESS POINTER Offset */
#define DMA_CHLLCFGSTAT_REG_OFST       _UINT32_(0x3C)      /* (DMA_CHLLCFGSTAT) CHANNEL LINKED LIST CONFIGURATION STATUS REGISTER Offset */
#define DMA_CHSTATBC_REG_OFST          _UINT32_(0x40)      /* (DMA_CHSTATBC) CHANNEL STATUS BLOCK COUNT REGISTER Offset */
#define DMA_CHSTATCC_REG_OFST          _UINT32_(0x44)      /* (DMA_CHSTATCC) CHANNEL STATUS CELL COUNT REGISTER Offset */
#define DMA_CHSTAT_REG_OFST            _UINT32_(0x48)      /* (DMA_CHSTAT) CHANNEL STATUS REGISTER Offset */
#define DMA_CTRLA_REG_OFST             _UINT32_(0x00)      /* (DMA_CTRLA) DMA CONTROL A REGISTER Offset */
#define DMA_CTRLB_REG_OFST             _UINT32_(0x04)      /* (DMA_CTRLB) DMA CONTROL B REGISTER Offset */
#define DMA_DBGCTRL_REG_OFST           _UINT32_(0x08)      /* (DMA_DBGCTRL) DEBUG CONTROL REGISTER Offset */
#define DMA_CRCPOLYA_REG_OFST          _UINT32_(0x0C)      /* (DMA_CRCPOLYA) DMA CRC POLYNOMIAL A REGISTER Offset */
#define DMA_CRCPOLYB_REG_OFST          _UINT32_(0x10)      /* (DMA_CRCPOLYB) DMA CRC POLYNOMIAL B REGISTER Offset */
#define DMA_INTSTAT3_REG_OFST          _UINT32_(0x18)      /* (DMA_INTSTAT3) DMA INTERRUPT PRIORITY 3 STATUS REGISTER Offset */
#define DMA_INTSTAT2_REG_OFST          _UINT32_(0x1C)      /* (DMA_INTSTAT2) DMA INTERRUPT PRIORITY 2 STATUS REGISTER Offset */
#define DMA_INTSTAT1_REG_OFST          _UINT32_(0x20)      /* (DMA_INTSTAT1) DMA INTERRUPT PRIORITY 1 STATUS REGISTER Offset */

